import React from 'react'
import '../../styles/Courses.scss'

const Descriptions = () => {
  return (
    <div className='courses'>
      <div className='courses__left'>
        <h2>เกี่ยวกับรายวิชา</h2>

        <p>
          สตริง แพนด้านอมินีออร์แกนิครุมบ้าสไตรค์
          เกรย์วอล์คเทรลเล่อร์มหาอุปราชาเทวา
          ผลไม้พาสเจอร์ไรส์ท็อปบูตเซฟตี้ดีพาร์ทเมนท์ สตริง บัตเตอร์วิก โอวัลติน
          นิวกรีนสตูดิโอสป็อตหลวงพี่ บัสยังไงโอเค
          เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต มาร์จินต่อรองยังไงเปราะบาง
          เรตเปราะบาง ดอกเตอร์บูติคสี่แยกช็อปเปอร์ รีโมท ภูมิทัศน์ทัวร์ฮัลโหล
          นิวกรีนสตูดิโอสป็อตหลวงพี่ บัสยังไงโอเค
          เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต มาร์จินต่อรองยังไงเปราะบาง
          เรตเปราะบาง ดอกเตอร์บูติคสี่แยกช็อปเปอร์ รีโมท ภูมิทัศน์ทัวร์ฮัลโหล
        </p>

        <p>เนื้อหาวิชา การประชาสัมพันธ์ผ่านวิทยุและโทรทัศน์ ประกอบไปด้วย</p>

        <p>
          บทที่ 1 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 2 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 3 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 4 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 5 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 6 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 7 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 8 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 9 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 10 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 11 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 12 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 13 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 14 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
        <p>
          บทที่ 15 เช็งเม้งตี๋ภควัมปติพริตตี้ซิมโฟนี โยเกิร์ต
          มาร์จินต่อรองยังไงเปราะบาง
        </p>
      </div>
      <div className='courses__right'>
        <div>
          <h2>วัตถุประสงค์</h2>

          <p>
            1. วิภัชภาค ช็อตติ่มซำรีพอร์ทชีส โปรดิวเซอร์คณาญาติถ่ายทำซีอีโอ
            คอนแทคทัวร์แอปเปิ้ล ซาตาน
          </p>
          <p>
            2. วิภัชภาค ช็อตติ่มซำรีพอร์ทชีส โปรดิวเซอร์คณาญาติถ่ายทำซีอีโอ
            คอนแทคทัวร์แอปเปิ้ล ซาตาน
          </p>
        </div>

        <div>
          <h2>เกณฑ์การวัดและประเมินผล</h2>

          <p>
            มีการวัดและประเมินผลผ่านแบบทดสอบย่อย (Quiz) และแบบทดสอบหลังเรียน
            (Posttest) โดยจะแบ่งเป็นคะแนนจาก Quiz เท่ากับ 50 คะแนน และคะแนนจาก
            Posttest เท่ากับ 50 คะแนน
            ทั้งนี้ผู้เรียนต้องทำคะแนนรวมทั้งหมดให้ได้ร้อยละ 60 ขึ้นไป
            และเรียนจบภายในเวลาที่กำหนดจึงจะสามารถขอรับ Certificate of
            Completion ได้
          </p>
        </div>

        <div>
          <h2>หมายเหตุ</h2>

          <p>
            1. ผู้เรียนจะมีสิทธิ์ทำแบบทดสอบหลังเรียน (Posttest)
            เมื่อเข้าร่วมกิจกรรมการเรียน (Course Progress) มากกว่า 80% ขึ้นไป
          </p>
          <p>
            2. แบบทดสอบหลังเรียน (Posttest)
            ในแต่ละวิชาจะสามารถทำได้แค่ครั้งเดียวเท่านั้น
          </p>
        </div>
      </div>
    </div>
  )
}

export default Descriptions
