import React from 'react'
import '../../styles/Courses.scss'
import { lessons } from '../../Lessons'

const Descriptions = () => {
  return (
    <div className='courses'>
      <div className='courses__left'>
        <h2>เกี่ยวกับรายวิชา</h2>

        <p>
          Tunang-Taning : เว็บแอปพลิเคชันอบรมก่อนแต่งงานสำหรับชาวมุสลิม คือ หลักสูตรอบรมก่อนแต่งงาน จัดทำโดยบริษัทสะนาบิล (ประเทศไทย) จำกัด โดย ผศ.ดร.อิสมาอีล ราโอบ ประธานบริษัทฯ เป็นผู้รับผิดชอบโครงการ ร่วมกับสำนักงานคณะกรรมการอิสลามประจำจังหวัดสตูล จัดทำขึ้นเพื่อส่งเสริมให้มุสลิมก่อนแต่งงานมีความรู้เรื่องบทบัญญัติและหลักการอิสลามที่สัมพันธ์กับการใช้ชีวิตคู่ระหว่างสามีและภรรยา โดยเนื้อหาทั้งหมดมี 15 ตอน ซึ่งแต่ละตอนจะประกอบด้วยวีดีโอสื่อการอบรม สอนโดยวิทยากรผู้เชี่ยวชาญด้านอิสลามศึกษาแนวหน้าของประเทศไทย ที่เป็นส่วนสำคัญในการผลักดันโครงการ Tunang-Taning ถึง 6 ท่าน ประกอบไปด้วย
        </p>

        <p>
          อรุณ อุมาจิ<br />
          ประธานคณะกรรมการอิสลามประจำจังหวัดสตูล
        </p>

        <p>
          อับดุลลอฮ์ อาเก็ม <br />
          หัวหน้าฝ่ายการต่างประเทศ สำนักงานคณะกรรมการอิสลามประจำจังหวัดสตูล
        </p>

        <p>
          อับดุลเลาะ ปังแลมาปุเลา <br />
          หัวหน้าฝ่ายวิชาการ สำนักงานคณะกรรมการอิสลามประจำจังหวัดสตูล
        </p>

        <p>
          ฮารูณ ราโอบ<br />
          ประธานมูลนิธิสะนาบิลเพื่อการศึกษาและพัฒนา
        </p>

        <p>
          ดร.มูฮัมหมัดอามีน คอยา<br />
          อาจารย์ประจำสาขาอิสลามศึกษา คณะอิสลามศึกษาและนิติศาสตร์ มหาวิทยาลัยฟาฏอนี
        </p>

        <p>
          ยูหารี มะเซ่ง<br />
          อาจารย์ประจำสาขาการสอนภาษาอาหรับ คณะศึกษาศาสตร์ มหาวิทยาลัยฟาฏอนี
        </p>

        <p>เนื้อหาหลักสูตรอบรมก่อนแต่งงาน</p>

        {
          lessons.map((item, index) => (
            index !== 0 && index !== lessons.length - 1 &&
            <p key={index}>{item.title}</p>
          ))
        }
      </div>
      <div className='courses__right'>
        <div>
          <h2>วัตถุประสงค์</h2>

          <p>
            1. สามารถนำเกียรติบัตรไปทำพิธีนิกะฮฺได้
          </p>
          <p>
            2. รู้บทบัญญัติเกี่ยวกับการแต่งงาน การจัดการวาลีมะห์
          </p>
          <p>
            3. ทราบถึงสิทธิหน้าที่ระหว่างสามีภรรยา
          </p>
          <p>
            4. เข้าใจการใช้ชีวิตคู่ตามวิถีอิสลาม
          </p>
        </div>

        <div>
          <h2>เกณฑ์การวัดและประเมินผล</h2>

          <p>
            1. ผู้เข้าร่วมอบรมหลักสูตรอบรมก่อนแต่งงานต้องเรียนรู้เนื้อหาอย่างน้อย 80%
          </p>
          <p>
            2. ทำแบบทดสอบหลังอบรมผ่าน 80%
          </p>
          <p>
            3. ประเมินความพึงพอใจต่อการใช้บริการแพลตฟอร์มอบรมก่อนแต่งงาน
          </p>
        </div>

        <div>
          <h2>หมายเหตุ</h2>

          <p>
            1. ผู้เรียนจะมีสิทธิ์ทำแบบทดสอบหลังเรียน (Posttest)
            เมื่อเข้าร่วมกิจกรรมการเรียน (Course Progress) มากกว่า 80% ขึ้นไป
          </p>
          <p>
            2. แบบทดสอบหลังเรียน (Posttest)
            ในแต่ละวิชาจะสามารถทำได้แค่ครั้งเดียวเท่านั้น
          </p>
        </div>
      </div>
    </div>
  )
}

export default Descriptions
