export const questions = [
    {
        title: 'ข้อใดกล่าวถูกต้องเกี่ยวกับบทบัญญัติการแต่งงานในอิสลาม',
        choices: [
            {
                id: 1,
                choice: 'ก.วายิบ : มูฮำมัดมีความพร้อมและมีความสามารถและไม่มั่นใจว่าจะควบคุมอารมณ์ของตนได้'
            },
            {
                id: 2,
                choice: 'ข. ฮาร่อม: อิสมาอีลมั่นใจว่า เมื่อแต่งงานแล้วอาจจะก่อให้เกิดความไม่เป็นธรรมแก่ภรรยา'
            },
            {
                id: 3,
                choice: 'ค. ซุนนะห์ : รอสดีไม่ปรารถนาจะแต่งงานหลายๆ คนได้'
            },
            {
                id: 4,
                choice: 'ง. มักรุฮ์ : มุสลิมมีอารมณ์ที่จะแต่งงานและไม่มีค่าสินสมรส'
            },
        ],
        answer: 1
    },
    {
        title: 'รู่กนนีกะห์มีกี่ประการ',
        choices: [
            {
                id: 1,
                choice: 'ก. 3 ประการ'
            },
            {
                id: 2,
                choice: 'ข. 4 ประการ'
            },
            {
                id: 3,
                choice: 'ค. 5 ประการ'
            },
            {
                id: 4,
                choice: 'ง. 6 ประการ'
            },
        ],
        answer: 3
    },
    {
        title: 'ข้อใดกล่าวถูกต้องเกี่ยวกับทรัพย์สินที่จะมอบเป็นค่าสินสอด (มะฮัร)',
        choices: [
            {
                id: 1,
                choice: 'ก. อามีนแอบไปเอาเงินของเพื่อนเพื่อมาเป็นค่าสินสอด'
            },
            {
                id: 2,
                choice: 'ข. อนันขโมยเงินจากที่ทำงานมาเป็นค่าสินสอดในการแต่งงานโดยไม่ได้รับอนุญาต'
            },
            {
                id: 3,
                choice: 'ค. ซัลมานนำเงินเก็บของตัวเองมาเป็นค่าสินสอนในการแต่งงาน'
            },
            {
                id: 4,
                choice: 'ง. นาอีมนำรถของเพื่อนไปขายเพื่อมาเป็นค่าสินสอด'
            },
        ],
        answer: 3
    },
    {
        title: '4. ข้อใดกล่าวถูกต้องเกี่ยวกับการแต่งงานของต่างศาสนิก',
        choices: [
            {
                id: 1,
                choice: 'ก. ยาซีรได้กำหนดก่อนแต่งงานว่าจะไม่ให้ค่าสินสอดแก่ดรุณี'
            },
            {
                id: 2,
                choice: 'ข. มุมีนะห์บอกว่าเป็นสาวโสดแต่ที่จริงแล้วเขาเป็นแม่หม้าย'
            },
            {
                id: 3,
                choice: 'ค. รอฮานีได้แต่งงานกับพีรเดชที่เป็นไทยพุทธและได้กล่าวชาฮาดะห์เรียบร้อยแล้ว'
            },
            {
                id: 4,
                choice: 'ง. ถูกทุกข้อ'
            },
        ],
        answer: 4
    },
    {
        title: 'ข้อใดคือความหมายของคำว่า “วาลีมะห์”',
        choices: [
            {
                id: 1,
                choice: 'ก. ฟิรมันจัดโต๊ะจีนและเรียกเงินจากคนที่มากินในงาน'
            },
            {
                id: 2,
                choice: 'ข. อัครอมได้จัดเลี้ยงอาหารขึ้นในพิธีการสมรส'
            },
            {
                id: 3,
                choice: 'ค. อิหซานจัดเลี้ยงเด็กกำพร้าในมูลนิธิ'
            },
            {
                id: 4,
                choice: 'ง. อาอีเซาะห์ชวนเพื่อนมากินข้าวในงานขึ้นบ้านใหม่'
            },
        ],
        answer: 2
    },
    {
        title: 'ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับการตอบรับคำเชิญไปร่วมงานวาลีมะห์',
        choices: [
            {
                id: 1,
                choice: 'ก. อัฟนานมาเชิญเพื่อนที่โรงเรียนด้วยตนเอง'
            },
            {
                id: 2,
                choice: 'ข. ฮิลมีเชิญเพื่อนเฉพาะคนรวยให้มางานแต่ง'
            },
            {
                id: 3,
                choice: 'ค. ลุตฟีเชิญญาติ ๆ และเพื่อนบ้านให้มาร่วมงานแต่ง'
            },
            {
                id: 4,
                choice: 'ง. ซัลมาเชิญเพื่อน ๆ และให้แต่งกายให้เรียบร้อยในการมาร่วมงานแต่ง'
            },
        ],
        answer: 1
    },
    {
        title: 'ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับการมีเพศสัมพันธ์',
        choices: [
            {
                id: 1,
                choice: 'ก. การมีเพศสัมพันธ์จะต้องให้มีความเหมาะสม และพอดี'
            },
            {
                id: 2,
                choice: 'ข. ทั้งสองหาสถานที่และเวลาที่เหมาะสมสำหรับการมีเพศสัมพันธ์'
            },
            {
                id: 3,
                choice: 'ค. ทั้งสองควรหยอกเย้าก่อนจะมีเพศสัมพันธ์เพื่อกระตุ้นอารมณ์ให้ครึกครื้นชุ่มฉ่ำ'
            },
            {
                id: 4,
                choice: 'ง. มีเพศสัมพันธ์ในกลางวันของเดือนรอมฎอนแต่ใช้สถานที่มิดชิด'
            },
        ],
        answer: 4
    },
    {
        title: 'หน้าที่ร่วมกันของสามีภรรยามีทั้งหมดกี่ประการ',
        choices: [
            {
                id: 1,
                choice: 'ก. 3 ประการ'
            },
            {
                id: 2,
                choice: 'ข. 4 ประการ'
            },
            {
                id: 3,
                choice: 'ค. 5 ประการ'
            },
            {
                id: 4,
                choice: 'ง. 6 ประการ'
            },
        ],
        answer: 2
    },
    {
        title: 'ข้อใดกล่าวไม่ถูกต้องเกี่ยวกับปัจจัยยังชีพ (นาฟาเกาะห์)',
        choices: [
            {
                id: 1,
                choice: 'ก. อามีนชอบซื้อข้าวและอาหารมารับประทานคนเดียว'
            },
            {
                id: 2,
                choice: 'ข. รอกีบซื้อของใช้ภายในบ้านมาให้ภรรยา'
            },
            {
                id: 3,
                choice: 'ค. อามีรไปเที่ยวตลาดเพื่อไปซื้อ เนื้อ ปลา ผัก ให้ภรรยา'
            },
            {
                id: 4,
                choice: 'ง. มะรูดิงชื้อเครื่องนุ่มห่มมาเซอร์ไพรส์ภรรยา'
            },
        ],
        answer: 1
    },
    {
        title: 'สาเหตุจากปัจจัยภายในข้อใดที่ทำให้ครอบครัวแตกแยก',
        choices: [
            {
                id: 1,
                choice: 'ก. อัลวานีมีคู่ครองที่เหมาะสม'
            },
            {
                id: 2,
                choice: 'ข. ฮัฟเซาะห์ไม่มีความบกพร่องทางทางเพศ'
            },
            {
                id: 3,
                choice: 'ค. รอกีเยาะห์โดนกดดันทางจิตใจ'
            },
            {
                id: 4,
                choice: 'ง. อาอีซะห์มีนิสัยดี'
            },
        ],
        answer: 3
    },
    {
        title: 'ข้อใดคือความหมายที่ถูกต้องของ “อิดดะห์”',
        choices: [
            {
                id: 1,
                choice: 'ก. เป็นช่วงระยะเวลาที่ภรรยาต้องรอคอย'
            },
            {
                id: 2,
                choice: 'ข. เป็นช่วงเวลาทำความสะอาดมดลูกผู้หญิง'
            },
            {
                id: 3,
                choice: 'ค. เพื่อสนองตอบพระบัญชาของพระองค์อัลลอฮ์(ซ.บ)'
            },
            {
                id: 4,
                choice: 'ง. ถูกทุกข้อ'
            },
        ],
        answer: 4
    },
    {
        title: 'เงื่อนไขของการคืนดี (รอเยาะ) มีกี่ประการ',
        choices: [
            {
                id: 1,
                choice: 'ก. 5 ประการ'
            },
            {
                id: 2,
                choice: 'ข. 6 ประการ'
            },
            {
                id: 3,
                choice: 'ค. 7 ประการ'
            },
            {
                id: 4,
                choice: 'ง. 8 ประการ'
            },
        ],
        answer: 2
    },
    {
        title: 'ข้อใดกล่าวถูกต้องเกียวกับซิฮาร',
        choices: [
            {
                id: 1,
                choice: 'ก. อบูบักรเปรียบเทียบคนข้างบ้านว่าเหมือนกับน้องสาวตนเอง'
            },
            {
                id: 2,
                choice: 'ข. อูมัรเปรียบเทียบภรรยาของตนเหมือนกับครูที่สอนหนังสือ'
            },
            {
                id: 3,
                choice: 'ค. อุสมานเปรียบเทียบภรรยาของตนเหมือนกับแม่ตนเอง'
            },
            {
                id: 4,
                choice: 'ง. อาลีเปรียบเทียบครูของตนเหมือนกับเพื่อน'
            },
        ],
        answer: 3
    },
    {
        title: 'ข้อใดกล่าวถึง “ลิอาน”',
        choices: [
            {
                id: 1,
                choice: 'ก. ถ้อยคำที่กำหนดขึ้นโดยใช้เป็นหลักฐานสำหรับสามีที่กล่าวหาภรรยาว่ามีชู้ และเพื่อปกป้องศักดิ์ศรีของตน'
            },
            {
                id: 2,
                choice: 'ข. ถ้อยคำที่กล่าวขึ้นเองโดยสามีที่กล่าวหาภรรยาว่าไม่มีชู้ และเพื่อปกป้องศักดิ์ศรีของตน'
            },
            {
                id: 3,
                choice: 'ค. การที่ผู้ชายคนหนึ่งเปรียบเทียบภรรยาของตน เหมือนกับผู้หญิงที่ห้ามแต่งงานคนใด'
            },
            {
                id: 4,
                choice: 'ง. ถ้อยคำที่กำหนดขึ้น โดยไม่ใช้เป็นหลักฐานสำหรับสามีที่กล่าวหาภรรยาว่ามีชู้'
            },
        ],
        answer: 1
    },
    {
        title: 'มัตอะห์ (ค่าทำขวัญ) มีความหมายว่าอย่างไร',
        choices: [
            {
                id: 1,
                choice: 'ก. ทรัพย์ที่ภรรยาที่ไม่จำเป็นต้องจ่ายให้กับสามีที่แยกทางกับตนด้วยการหย่า'
            },
            {
                id: 2,
                choice: 'ข. ทรัพย์ที่สามีไม่จำเป็นต้องจ่ายให้กับภรรยาที่แยกทางกับตน'
            },
            {
                id: 3,
                choice: 'ค. ทรัพย์ที่ภรรยาไม่จำเป็นต้องจ่ายให้กับสามีที่แยกทางกับตน'
            },
            {
                id: 4,
                choice: 'ง. ทรัพย์ที่สามีจำเป็นต้องจ่ายให้กับภรรยาที่แยกทางกับตนด้วยการหย่า หรือด้วยการแยกทาง'
            },
        ],
        answer: 4
    },
    {
        title: 'ข้อใดกล่าวถูกต้องเกี่ยวกับสาเหตุที่ทำให้มีสิทธิในการสืบมรดก',
        choices: [
            {
                id: 1,
                choice: 'ก. อามีเนาะมีการสมรสที่ถูกต้องตามนิติบัญญัติอิสลาม มิใช่การสมรสตามกฎหมาย'
            },
            {
                id: 2,
                choice: 'ข. อาดีละห์เป็นทายาทที่มีสิทธิรับมรดกในอิสลาม'
            },
            {
                id: 3,
                choice: 'ค. อัดนานมีทาสอยู่ในครอบครองแล้วได้ปลดปล่อยทาสให้เป็นอิสระ เมื่อทาสที่เขาปล่อยไปถึงแก่ความตายและไม่มีผู้ใดรับมรดก ผู้ที่ปลดปล่อยเขาก็จะได้มีสิทธิ์รับมรดกของเขาได้'
            },
            {
                id: 4,
                choice: 'ง. ถูกทุกข้อ'
            },
        ],
        answer: 4
    },
]